"Every 10 minutes" = "Hvert 10. minutt";
"Manually" = "Manuelt";
"Rescan" = "Rescan";
"Show Info" = "Vis info";
"Delete selected source" = "Slett valgt kilde";
"Every day" = "Hver dag";
"Add source..." = "Legg til kilde...";
"Every half hour" = "Every half hour";
"Rescan source" = "Rescan source";
"Sources" = "Kilder";
"Every hour" = "Hver time";
"Rescan frequency" = "Rescan frequency";
